{
  "storage" : "model.espresso.weights",
  "properties" : {

  },
  "format_version" : 200,
  "layers" : [
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv1_1conv1_relu_layer",
      "blob_weights" : 3,
      "K" : 3,
      "blob_biases" : 1,
      "name" : "conv1_layer",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "input",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : 0.10000000149011612,
      "bottom" : "conv1_1conv1_relu_layer",
      "weights" : {

      },
      "mode" : 2,
      "top" : "conv1",
      "type" : "activation",
      "name" : "conv1_relu_layer"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2_3conv2_relu_layer",
      "blob_weights" : 7,
      "K" : 32,
      "blob_biases" : 5,
      "name" : "conv2_layer",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "conv1",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : 0.10000000149011612,
      "bottom" : "conv2_3conv2_relu_layer",
      "weights" : {

      },
      "mode" : 2,
      "top" : "conv2",
      "type" : "activation",
      "name" : "conv2_relu_layer"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv3_5conv3_relu_layer",
      "blob_weights" : 11,
      "K" : 32,
      "blob_biases" : 9,
      "name" : "conv3_layer",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "conv2",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : 0.10000000149011612,
      "bottom" : "conv3_5conv3_relu_layer",
      "weights" : {

      },
      "mode" : 2,
      "top" : "conv3",
      "type" : "activation",
      "name" : "conv3_relu_layer"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv4_7conv4_relu_layer",
      "blob_weights" : 15,
      "K" : 64,
      "blob_biases" : 13,
      "name" : "conv4_layer",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "conv3",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : 0.10000000149011612,
      "bottom" : "conv4_7conv4_relu_layer",
      "weights" : {

      },
      "mode" : 2,
      "top" : "conv4",
      "type" : "activation",
      "name" : "conv4_relu_layer"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv5_9conv5_relu_layer",
      "blob_weights" : 19,
      "K" : 64,
      "blob_biases" : 17,
      "name" : "conv5_layer",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "conv4",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : 0.10000000149011612,
      "bottom" : "conv5_9conv5_relu_layer",
      "weights" : {

      },
      "mode" : 2,
      "top" : "conv5",
      "type" : "activation",
      "name" : "conv5_relu_layer"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv6_11conv6_relu_layer",
      "blob_weights" : 23,
      "K" : 128,
      "blob_biases" : 21,
      "name" : "conv6_layer",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "conv5",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : 0.10000000149011612,
      "bottom" : "conv6_11conv6_relu_layer",
      "weights" : {

      },
      "mode" : 2,
      "top" : "conv6",
      "type" : "activation",
      "name" : "conv6_relu_layer"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv7",
      "blob_weights" : 27,
      "K" : 128,
      "blob_biases" : 25,
      "name" : "conv7_layer",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 3,
      "bottom" : "conv6",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    }
  ]
}